bench/custom/logs/fuse/ramdisk/origin/fuse_write_0-1.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=34570: Thu May 30 00:32:28 2024
  write: IOPS=238k, BW=929MiB/s (974MB/s)(32.0GiB/35268msec); 0 zone resets
    clat (usec): min=10, max=57477, avg=131.08, stdev=128.27
     lat (usec): min=10, max=57477, avg=131.17, stdev=129.31
    clat percentiles (usec):
     |  1.00th=[   35],  5.00th=[   75], 10.00th=[   91], 20.00th=[  105],
     | 30.00th=[  115], 40.00th=[  123], 50.00th=[  130], 60.00th=[  137],
     | 70.00th=[  147], 80.00th=[  157], 90.00th=[  174], 95.00th=[  188],
     | 99.00th=[  223], 99.50th=[  241], 99.90th=[  289], 99.95th=[  318],
     | 99.99th=[  529]
   bw (  KiB/s): min=759050, max=1783953, per=100.00%, avg=966191.90, stdev=4506.44, samples=2192
   iops        : min=189762, max=445983, avg=241547.50, stdev=1126.60, samples=2192
  lat (usec)   : 20=0.19%, 50=1.75%, 100=13.75%, 250=83.95%, 500=0.34%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.85%, sys=5.52%, ctx=8401279, majf=0, minf=280
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=929MiB/s (974MB/s), 929MiB/s-929MiB/s (974MB/s-974MB/s), io=32.0GiB (34.4GB), run=35268-35268msec