bench/custom/logs/fuse/ramdisk/origin/fuse_write_0-3.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=34681: Thu May 30 00:34:08 2024
  write: IOPS=359k, BW=1401MiB/s (1469MB/s)(32.0GiB/23382msec); 0 zone resets
    clat (usec): min=11, max=120229, avg=85.88, stdev=188.16
     lat (usec): min=11, max=120229, avg=85.95, stdev=188.21
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   35], 10.00th=[   50], 20.00th=[   63],
     | 30.00th=[   70], 40.00th=[   78], 50.00th=[   84], 60.00th=[   90],
     | 70.00th=[   98], 80.00th=[  108], 90.00th=[  122], 95.00th=[  137],
     | 99.00th=[  169], 99.50th=[  186], 99.90th=[  285], 99.95th=[  494],
     | 99.99th=[ 1516]
   bw (  MiB/s): min=  902, max= 2435, per=100.00%, avg=1430.55, stdev= 9.91, samples=1431
   iops        : min=230925, max=623483, avg=366219.68, stdev=2535.76, samples=1431
  lat (usec)   : 20=1.09%, 50=8.95%, 100=63.24%, 250=26.59%, 500=0.08%
  lat (usec)   : 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.16%, sys=11.66%, ctx=8422014, majf=0, minf=304
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1401MiB/s (1469MB/s), 1401MiB/s-1401MiB/s (1469MB/s-1469MB/s), io=32.0GiB (34.4GB), run=23382-23382msec