bench/custom/logs/fuse/ramdisk/origin/fuse_write_0-31.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=71720: Thu May 30 00:38:44 2024
  write: IOPS=509k, BW=1989MiB/s (2085MB/s)(32.0GiB/16477msec); 0 zone resets
    clat (usec): min=11, max=8252, avg=61.80, stdev=19.95
     lat (usec): min=11, max=8252, avg=61.92, stdev=19.95
    clat percentiles (usec):
     |  1.00th=[   37],  5.00th=[   41], 10.00th=[   43], 20.00th=[   46],
     | 30.00th=[   52], 40.00th=[   59], 50.00th=[   63], 60.00th=[   66],
     | 70.00th=[   69], 80.00th=[   72], 90.00th=[   77], 95.00th=[   86],
     | 99.00th=[  131], 99.50th=[  157], 99.90th=[  225], 99.95th=[  253],
     | 99.99th=[  330]
   bw (  MiB/s): min= 1747, max= 2604, per=100.00%, avg=1993.56, stdev= 8.30, samples=1024
   iops        : min=447468, max=666678, avg=510350.69, stdev=2123.87, samples=1024
  lat (usec)   : 20=0.05%, 50=27.93%, 100=69.34%, 250=2.63%, 500=0.05%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.90%, sys=13.96%, ctx=8388978, majf=0, minf=563
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1989MiB/s (2085MB/s), 1989MiB/s-1989MiB/s (2085MB/s-2085MB/s), io=32.0GiB (34.4GB), run=16477-16477msec