bench/custom/logs/fuse/ramdisk/origin/fuse_write_0-7.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=34819: Thu May 30 00:35:37 2024
  write: IOPS=654k, BW=2556MiB/s (2680MB/s)(32.0GiB/12822msec); 0 zone resets
    clat (usec): min=11, max=3126, avg=44.96, stdev=13.59
     lat (usec): min=11, max=3127, avg=45.03, stdev=13.60
    clat percentiles (usec):
     |  1.00th=[   21],  5.00th=[   30], 10.00th=[   33], 20.00th=[   36],
     | 30.00th=[   38], 40.00th=[   40], 50.00th=[   43], 60.00th=[   45],
     | 70.00th=[   49], 80.00th=[   55], 90.00th=[   62], 95.00th=[   69],
     | 99.00th=[   86], 99.50th=[   95], 99.90th=[  124], 99.95th=[  141],
     | 99.99th=[  186]
   bw (  MiB/s): min= 2550, max= 3382, per=100.00%, avg=2717.97, stdev= 6.55, samples=748
   iops        : min=653048, max=866009, avg=695799.36, stdev=1675.59, samples=748
  lat (usec)   : 20=0.82%, 50=72.24%, 100=26.60%, 250=0.34%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=3.29%, sys=15.75%, ctx=8421914, majf=0, minf=275
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2556MiB/s (2680MB/s), 2556MiB/s-2556MiB/s (2680MB/s-2680MB/s), io=32.0GiB (34.4GB), run=12822-12822msec