bench/custom/logs/fuse/ramdisk/origin/fuse_write_ramdisk_none.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=3783: Thu May 30 03:42:24 2024
  write: IOPS=590k, BW=2304MiB/s (2416MB/s)(32.0GiB/14222msec); 0 zone resets
    clat (usec): min=12, max=5388, avg=52.60, stdev=17.27
     lat (usec): min=12, max=5388, avg=52.75, stdev=17.27
    clat percentiles (usec):
     |  1.00th=[   34],  5.00th=[   40], 10.00th=[   42], 20.00th=[   44],
     | 30.00th=[   45], 40.00th=[   47], 50.00th=[   48], 60.00th=[   50],
     | 70.00th=[   52], 80.00th=[   60], 90.00th=[   74], 95.00th=[   81],
     | 99.00th=[  114], 99.50th=[  131], 99.90th=[  178], 99.95th=[  202],
     | 99.99th=[  277]
   bw (  MiB/s): min= 1911, max= 2653, per=100.00%, avg=2325.49, stdev= 5.00, samples=884
   iops        : min=489268, max=679268, avg=595325.41, stdev=1281.03, samples=884
  lat (usec)   : 20=0.10%, 50=62.60%, 100=35.24%, 250=2.04%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=3.41%, sys=21.04%, ctx=8391508, majf=0, minf=696
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2304MiB/s (2416MB/s), 2304MiB/s-2304MiB/s (2416MB/s-2416MB/s), io=32.0GiB (34.4GB), run=14222-14222msec